/*
函数的默认参数
返回值类型 函数名（参数=默认值）
1.如果某个位置有了默认参数，那么从这个位置往后都必须有默认值
2.函式的声明有了默认参数之后实现就不能有了（声明和实现之中只能有一个有默认值）

函数的占位参数
c++的形参列表之中可以有占位参数，用来占位，调用参数时必须填补这个位置
语法：返回值类型 函数名 （数据类型） {}
占位参数：只写数据类型，不写函数名,在调用函数的时候需要传入相应格式的数据，并且占位参数也可以有默认值

函数重载
在同一个作用域中，函数名可以相同（但是函数参数类型不同或者个数不同或者顺序不同），提高复用性















*/
#include <iostream>
using namespace std;
int func1(int a=1,int b=2)
{
    return a+b;
}
int func1(int a,int b,int c)//函数的复用
{
    return a+b+c;
}
void func2(int a,int)//占位参数：只写数据类型，不写函数名,在调用函数的时候需要传入相应格式的数据
{

}
int main()
{
    cout<<func1();//在未传入数据的时候，使用函数声明中的默认值
    func2(2,20);
}