/*
c++中的引用
作用：给变量起别名
语法：数据类型 &别名 = 原名
（别名和原名可以一样）
别名与原名都指向同一块内存
对别名的一切操作都会影响原名

注意事项：
1.引用必须初始化，不能创建一个空的别名
2.一旦初始化后，就不可以更改

引用作函数参数
函数传参时，可以利用引用让形参修饰实参
1.值传递  2，地址传递  
3.引用传递
void swap(int &a,int &b)
{
int temp=a;
a=b;
b=temp;
}
传入的实参也发生了交换

引用做函数的返回值
1.不能返回局部变量的引用 
2.返回值是引用的函数的调用可以作为左值存在
int &test()
{
    static int a=10;
    return a;
}
    int main()
    {
        test()=1000;
    }

引用的本质
引用的本质在c++内部的实现就是一个指针常量（值可改，方向不能改），可以自动取址和解引用
int &a=b实际上就是int *const a=&b

常量引用
使用场景：用来修饰形参，防止误操作
我写的：
const int &ref=10
编译器看到的：
int temp=10;  const int &ref=temp;
故常量引用可以直接赋值为一个常量/定值













*/