/*
一维数组的定义方式
数据类型 数组名 [数组长度] = {n0,n1,n2........}   注意，c++的数组从零开始
int arr[10] = {1,2,3}     剩余元素自动补零、
int arr[10] = {}     所有元素都是零
int arr{} = {1,2,3,4,5}  省略数组长度，编译器dd自动判断
通过下标可以访问元素
如：arr[3]是arr数组中的第3个元素
常用for循环遍历数组
数组元素个数=sizeof（arr）/sizeof（arr[0]）
一维数组名称的用途
cout<<arr   //查看数组的首地址
cout<<&arr[i]   //查看第i个元素的地址，其中&是取址符

数组元素逆置
1，2，3，4，5——>5，4，3，2，1
需要引入临时存储

二维数组的定义方式
###注意，行数和列数都是从0开始
1.数据类型  数组名[行数][列数]
2（推荐）.数据类型  数组名[行数][列数] =  {   {数据1 ，数据2}，{数据3，数据4}，{数据5，数据6}  } 
例如 ：int arr[2][3]={{1,2,3},{4,5,6}}  
其数组格式为  1   2   3
             4   5   6      
行数可以不写，电脑会自行判断行数  
3.数据类型  数组名【行数】【列数】= {数据1，数据2，数据3，数据4}

二维数组的数组名

多维数组的打印可以用多层的嵌套循环，每层循环打印一个维度










*/

#include <iostream>
using  namespace std;
int main()
{
int i=0,E;
int arr[]={1,2,3,4,5,6};
int e=(sizeof(arr)/sizeof(arr[0]))-1;
E=e;
while(i<=(E/2))
{int temp=arr[i];
arr[i]=arr[e];
arr[e]=temp;
i++;
e--;}
for(int n=0;n<=E;n++)
{
cout<<arr[n]<<" ";
};
 return 0;

    


} 
