/*
c++面向对象的三大特性为：封装，继承，多态。万事万物都是对象，其上有属性和行为，有相同性质的对象可以抽象成为一类

封装
封装：将属性和行为作为一个整体，表现生活中的事物，并将属性和行为加以权限控制
class 类名
{
//访问权限
//属性
//访问权限
//行为
}
实例化一个对象
类名  对象名；
访问对象的属性和行为
对象名.属性名
对象名.行为名



类中的属性和成员统一都叫做成员
属性也叫成员属性或成员变量
行为也叫成员函数或成员方法
在设计类的时候，可以把属性和行为放在不同的权限下，加以控制
访问权限：1.public 公共权限，类内外都可以访问
          2.protected 保护权限，类内和子类中可以访问
          3.private   私有权限，类内可以访问，子类不能访问

封装中class和struct的唯一区别：struct中成员默认是公共权限，class中成员默认是私有权限

对象的初始化和清理
1.构造函数和析构函数
构造函数语法：类名{}{}
不写返回值也不写void，函数名和类名相同，构造函数可以有参数因此可以发生重载（）变量名相同 ，程序在调用对象的时候会自动调用构造，无需手动调用，而且只会调用一次

2.析构函数语法：~类名{}{}
没有返回值也不写void，函数名与类名相同前面写~，不可以有参数，因此不能发生重载，程序在对象销毁之前会自动调用析构函数，无需手动调用，而且只会调用一次
















*/
#include <iostream>
using namespace std;
const double pi=3.14;
class circle//创建一个类，表示圆
{
    //访问权限:公共权限
    public:
    //属性
    int m_r;//半径
    //行为
    //获取圆的周长
    double calculate_C()
    {
        return 2*pi*m_r;
    }
};
int main()
{
    //通过圆类，创建一个具体的圆（对象），这个过程也叫实例化
    circle c1;
    //对c1的属性进行赋值
    c1.m_r=10;
   cout<<"圆的周长为"<<c1.calculate_C()<<endl;
    return 0;
}