/*指针:记录地址的变量
1.如何定义一个指针
//数据类型 * 指针变量名
int a = 10;
int * p;
//让指针记录变量a的地址
p = &a;
cout<<*p<<p      （*p即p指针的解引用，输出指针指向的值）
输出结果为10 a的地址


2.如何使用一个指针
可以通过解引用的方式来找到指针指向的内存存储的数据,即指针前面加一个星号，由此可以修改或者读取

***指针的数据格式要和它指向的内存中存储的数据类型一致
指针也是一种数据类型，占用四个字节（32位）,无论数据类型

空指针与野指针
空指针：指针变量指向内存编号中为0的空间
用途：初始化变量指针
int *p = NULL(系统编号为零的内存)
注意：空指针的内存是不可以访问的
0~255之间的内存编号时系统占用的，不能访问
野指针：指针变量
int * p = (int *)0x1100
空指针与野指针都不时我们自己申请的内存，因此不能访问

const修饰指针
1.const修饰指针——常量指针
int a=10,  int b=10;   
const int *p=&a;
*p = 20（wrong）
p = &b（correct）
常量指针的指向可以修改，但是指向的值不能修改,也就是说*p=....这样的更改p指向的值的语句是不能用的，要改只能改指向，值也变成了新指向的值
故p可以更改，而*p不能更改

2.const修饰常量——指针常量
int *const p = &a
指针指向不能改，即*p=&...语句不能用，指向始终为一开始设定的内存。只能改指向的值

3.const既修饰指针，又修饰常量
const int * const P=&A
指针指向的量和指向都不能更改

指针和数组
利用指针访问数组中的元素
int arr[10] = {1,2,3,4,5,6,7,8,9.10};
int *p=arr ；    // (arr就是数组的首地址)
cout <<*p；    //（输出数组中的第一个元素）、
p++；          //（让指针向后偏移四个字节，不同类型，偏移不同，int占四个字节，故下一个元素在四个字节之后）

指针和函数
利用指针作为函数的参数
值传递无法改变实参
地址传递可以改变实参的地址
即在函数中用指针接受实参的内存地址之后直接对实参的内存进行读写，故可以改变实参的数值。
#include <iostream>
using namespace std;
void swi (int *p1,int *p2)
{
    int temp=*p1;
    *p1=*p2;
    *p2=temp;   //直接对内存指向的值进行操作，能够影响到使用该内存的变量
    
}
int main ()
{
    int a=10;
    int b=20;
    swi (&a,&b);
    cout<<a<<b<<endl;//输出值后得知可以看到a与b的值发生了交换
    return 0;
}
















*/
#include <iostream>
using namespace std;
void swi (int *p1,int *p2)
{
    int temp=*p1;
    *p1=*p2;
    *p2=temp;
    
}
int main ()
{
    int a=10;
    int b=20;
    swi (&a,&b);
    cout<<a<<b<<endl;
    return 0;
}